//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="Изпълнение на стъпка %d от %d: Изграждане на архива от единици";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="Изпълнение на стъпка %d от %d: Създаване на базата данни за начално зареждане";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="Изпълнение на стъпка %d от %d: Създаване на база данни за опашки от заявки";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="Изпълнение на стъпка %d от %d: Изтегляне на архива от единици. Получени %s от %s до момента.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="Изпълнение на стъпка %d от %d: Изтриване на заявки с изтекъл срок";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="Изпълнение на стъпка %d от %d: Зареждане на метаданните";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="Изпълнение на стъпка %d от %d: Изпълнение на обединение на опашки от заявки";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="Изпълнение на стъпка %d от %d: Изпълнение на обединение на транзакции";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="Изпълнение на стъпка %d от %d: Изпълнение на създаване, изтриване и обединение";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="Изпълнение на стъпка %d от %d: Обработка на определянето на запитвания %s чрез %s’";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="Изпълнение на стъпка %d от %d: Обработка на заявки. Изпращане на заявка за изменение %s от %s’";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="Изпълнение на стъпка %d от %d: Повторно прилагане на промени";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="Изпълнение на стъпка %d от %d: Анализиране на получените данни";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="Изпълнение на стъпка %d от %d: Получаване на данни от сървъра: Получени %s’ до момента.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="Изпълнение на стъпка %d от %d: Премахване на изтритите отношения";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="Изпълнение на стъпка %d от %d: Премахване на заявките, посочени като RemoveAfterUpload";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="Изпълнение на стъпка %d от %d: Изпращане на данни в сървъра: Изпратени %s’ до момента.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="Изпълнение на стъпка %d от %d: Изтегляне на базата данни за съхранение на единици. Получени %s от %s до момента.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="Изпълнение на стъпка %d от %d: Изпращане на базата данни за опашки от заявки. Изпратени %s от %s до момента.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="Изпълнение на стъпка %d от %d: Стартиране на комуникацията със сървъра";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="Изпълнение на стъпка %d от %d: Предварителна обработка на заявки преди качването им";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="Изпълнение на стъпка %d от %d: Изчакване на изтегляне";
